breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410xB.h
/**
******************************************************************************
* @file    py32f410xB.h
* @brief   CMSIS Cortex-M4 Device Peripheral Access Layer Header File.
*          This file contains all the peripheral register's definitions, bits
*          definitions and memory mapping for PY32F4xx devices.
* @version v1.0.0
*
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#ifndef __PY32F410xB_H
#define __PY32F410xB_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
* @brief Configuration of the Cortex-M4 Processor and Core Peripherals
*/
#define __CM4_REV                 0x0001U  /*!< Core revision r0p1                            */
#define __MPU_PRESENT             0U       /*!< PY32F4xx provides an MPU                      */
#define __NVIC_PRIO_BITS          3U       /*!< PY32F4xx uses 3 Bits for the Priority Levels  */
#define __Vendor_SysTickConfig    0U       /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT             1U       /*!< FPU present                                   */

/**
 * @brief PY32F4xx Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
typedef enum
{
  /******  Cortex-M4 Processor Exceptions Numbers **************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                          */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M4 Hard Fault Interrupt                                  */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M4 Memory Management Interrupt                           */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M4 Bus Fault Interrupt                                   */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M4 Usage Fault Interrupt                                 */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M4 SV Call Interrupt                                    */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M4 Debug Monitor Interrupt                              */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M4 Pend SV Interrupt                                    */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M4 System Tick Interrupt                                */
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                                         */
  PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detection Interrupt                         */
  TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                                  */
  RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                              */
  FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                                            */
  RCC_IRQn                    = 5,      /*!< RCC global Interrupt                                              */
  EXTI0_IRQn                  = 6,      /*!< EXTI Line0 Interrupt                                              */
  EXTI1_IRQn                  = 7,      /*!< EXTI Line1 Interrupt                                              */
  EXTI2_IRQn                  = 8,      /*!< EXTI Line2 Interrupt                                              */
  EXTI3_IRQn                  = 9,      /*!< EXTI Line3 Interrupt                                              */
  EXTI4_IRQn                  = 10,     /*!< EXTI Line4 Interrupt                                              */
  EXTI9_5_IRQn                = 11,     /*!< External Line[5:9] Interrupt                                      */
  EXTI15_10_IRQn              = 12,     /*!< External Line[15:10] Interrupt                                    */
  DMA1_Channel1_IRQn          = 13,     /*!< DMA1 Channel 1 global Interrupt                                   */
  DMA1_Channel2_IRQn          = 14,     /*!< DMA1 Channel 2 global Interrupt                                   */
  DMA1_Channel3_IRQn          = 15,     /*!< DMA1 Channel 3 global Interrupt                                   */
  DMA1_Channel4_IRQn          = 16,     /*!< DMA1 Channel 4 global Interrupt                                   */
  DMA1_Channel5_IRQn          = 17,     /*!< DMA1 Channel 5 global Interrupt                                   */
  DMA1_Channel6_IRQn          = 18,     /*!< DMA1 Channel 6 global Interrupt                                   */
  DMA1_Channel7_IRQn          = 19,     /*!< DMA1 Channel 7 global Interrupt                                   */
  DMA1_Channel8_IRQn          = 20,     /*!< DMA1 Channel 8 global Interrupt                                   */
  ADC_IRQn                    = 21,     /*!< ADC global Interrupt                                              */
  TIM1_BRK_IRQn               = 22,     /*!< TIM1 global Interrupt                                             */
  TIM1_UP_IRQn                = 23,     /*!< TIM1 Update Interrupt global Interrupt                            */
  TIM1_TRG_COM_IRQn           = 24,     /*!< TIM1 Trigger and Commutation Interrupt global interrupt           */
  TIM1_CC_IRQn                = 25,     /*!< TIM1 Capture Compare Interrupt                                    */
  TIM2_IRQn                   = 26,     /*!< TIM2 global Interrupt                                             */
  TIM3_IRQn                   = 27,     /*!< TIM3 global Interrupt                                             */
  TIM4_IRQn                   = 28,     /*!< TIM4 global Interrupt                                             */
  TIM6_IRQn                   = 29,     /*!< TIM6 global Interrupt                                             */
  TIM7_IRQn                   = 30,     /*!< TIM7 global Interrupt                                             */
  TIM15_IRQn                  = 31,     /*!< TIM15 global Interrupt                                            */
  TIM16_IRQn                  = 32,     /*!< TIM16 global Interrupt                                            */
  TIM17_IRQn                  = 33,     /*!< TIM17 global Interrupt                                            */
  PWM1_IRQn                   = 34,     /*!< PWM1 global Interrupt                                             */
  PWM2_IRQn                   = 35,     /*!< PWM2 global Interrupt                                             */
  PWM3_IRQn                   = 36,     /*!< PWM3 global Interrupt                                             */
  PWM4_IRQn                   = 37,     /*!< PWM4 global Interrupt                                             */
  LPTIM_IRQn                  = 38,     /*!< LPTIM global Interrupt                                            */
  SPI1_IRQn                   = 39,     /*!< SPI1 global Interrupt                                             */
  SPI2_IRQn                   = 40,     /*!< SPI2 global Interrupt                                             */
  USART_IRQn                  = 41,     /*!< USART global Interrupt                                            */
  UART1_IRQn                  = 42,     /*!< UART1 global Interrupt                                            */
  UART2_IRQn                  = 43,     /*!< UART2 global Interrupt                                            */
  LPUART_IRQn                 = 44,     /*!< LPUART global Interrupt                                           */
  RTC_Alarm_IRQn              = 45,     /*!< RTC Alarm through EXTI Line Interrupt                             */
  I2C1_EV_IRQn                = 46,     /*!< I2C1 Event Interrupt                                              */
  I2C1_ER_IRQn                = 47,     /*!< I2C1 Error Interrupt                                              */
  I2C2_EV_IRQn                = 48,     /*!< I2C2 Event Interrupt                                              */
  I2C2_ER_IRQn                = 49,     /*!< I2C2 Error Interrupt                                              */
  COMP1_IRQn                  = 50,     /*!< COMP1 global Interrupt                                            */
  COMP2_IRQn                  = 51,     /*!< COMP2 global Interrupt                                            */
  OPA2_IRQn                   = 52,     /*!< OPA2 global Interrupt                                             */
} IRQn_Type;

