breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410xB.h
#define COMP_CSR_VCDIV_Pos         (20U)
#define COMP_CSR_VCDIV_Msk         (0xFFUL << COMP_CSR_VCDIV_Pos)              /*!< 0x0FF00000 */
#define COMP_CSR_VCDIV             COMP_CSR_VCDIV_Msk                          /*!< VCDIV[27:20] bits (desc VCDIV) */
#define COMP_CSR_VCDIV_0           (0x1UL << COMP_CSR_VCDIV_Pos)               /*!< 0x00100000 */
#define COMP_CSR_VCDIV_1           (0x2UL << COMP_CSR_VCDIV_Pos)               /*!< 0x00200000 */
#define COMP_CSR_VCDIV_2           (0x4UL << COMP_CSR_VCDIV_Pos)               /*!< 0x00400000 */
#define COMP_CSR_VCDIV_3           (0x8UL << COMP_CSR_VCDIV_Pos)               /*!< 0x00800000 */
#define COMP_CSR_VCDIV_4           (0x10UL << COMP_CSR_VCDIV_Pos)              /*!< 0x01000000 */
#define COMP_CSR_VCDIV_5           (0x20UL << COMP_CSR_VCDIV_Pos)              /*!< 0x02000000 */
#define COMP_CSR_VCDIV_6           (0x40UL << COMP_CSR_VCDIV_Pos)              /*!< 0x04000000 */
#define COMP_CSR_VCDIV_7           (0x80UL << COMP_CSR_VCDIV_Pos)              /*!< 0x08000000 */

#define COMP_CSR_VCSEL_Pos         (28U)
#define COMP_CSR_VCSEL_Msk         (0x1UL << COMP_CSR_VCSEL_Pos)               /*!< 0x10000000 */
#define COMP_CSR_VCSEL             COMP_CSR_VCSEL_Msk                          /*!< desc VCSEL */

#define COMP_CSR_TIM_EXTI_OUT_SEL_Pos         (29U)
#define COMP_CSR_TIM_EXTI_OUT_SEL_Msk         (0x1UL << COMP_CSR_TIM_EXTI_OUT_SEL_Pos)               /*!< 0x02000000 */
#define COMP_CSR_TIM_EXTI_OUT_SEL             COMP_CSR_TIM_EXTI_OUT_SEL_Msk                          /*!< COMP output to TIM/EXTI selection */

#define COMP_CSR_COMP_OUT_Pos      (30U)
#define COMP_CSR_COMP_OUT_Msk      (0x1UL << COMP_CSR_COMP_OUT_Pos)            /*!< 0x40000000 */
#define COMP_CSR_COMP_OUT          COMP_CSR_COMP_OUT_Msk                       /*!< COMP output status */

#define COMP_CSR_LOCK_Pos          (31U)
#define COMP_CSR_LOCK_Msk          (0x1UL << COMP_CSR_LOCK_Pos)                /*!< 0x80000000 */
#define COMP_CSR_LOCK              COMP_CSR_LOCK_Msk                           /*!< desc COMP_OUT */

/**********************  Bit definition for COMP_FR register  ***************/
#define COMP_FR_FLTEN_Pos          (0U)
#define COMP_FR_FLTEN_Msk          (0x1UL << COMP_FR_FLTEN_Pos)                /*!< 0x00000001 */
#define COMP_FR_FLTEN              COMP_FR_FLTEN_Msk                           /*!< Comparator filter enable */
#define COMP_FR_FLTCNT_Pos         (16U)
#define COMP_FR_FLTCNT_Msk         (0xFFFFUL << COMP_FR_FLTCNT_Pos)            /*!< 0xFFFF0000 */
#define COMP_FR_FLTCNT             COMP_FR_FLTCNT_Msk                          /*!< Comparator filter counter */

/********************************************************************************************************************/
/********************************* CRC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for CRC_DR register ***********************************************/
#define CRC_DR_DR_Pos                             (0U)
#define CRC_DR_DR_Msk                             (0xFFFFFFFFUL<<CRC_DR_DR_Pos)                     /*!< 0xFFFFFFFF */
#define CRC_DR_DR                                 CRC_DR_DR_Msk                                     /*!< CRC data */

/********************************* Bit definition for CRC_IDR register **********************************************/
#define CRC_IDR_IDR_Pos                           (0U)
#define CRC_IDR_IDR_Msk                           (0xFFUL<<CRC_IDR_IDR_Pos)                         /*!< 0xFF */
#define CRC_IDR_IDR                               CRC_IDR_IDR_Msk                                   /*!< CRC independent data */

/********************************* Bit definition for CRC_CR register ***********************************************/
#define CRC_CR_RESET_Pos                          (0U)
#define CRC_CR_RESET_Msk                          (0x1UL<<CRC_CR_RESET_Pos)                         /*!< 0x00000001 */
#define CRC_CR_RESET                              CRC_CR_RESET_Msk                                  /*!< CRC software reset */

/********************************************************************************************************************/
/********************************* DBG ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DBGMCU_IDCODE register ****************************************/
#define DBGMCU_IDCODE_REV_ID_Pos                   (0U)
#define DBGMCU_IDCODE_REV_ID_Msk                   (0xFFFFFFFFUL << DBGMCU_IDCODE_REV_ID_Pos)          /*!< 0xFFFFFFFF */
#define DBGMCU_IDCODE_REV_ID                       DBGMCU_IDCODE_REV_ID_Msk                            /*!< REV_ID[31:0] bits (desc REV_ID) */

/********************************* Bit definition for DBGMCU_CR1 register *******************************************/
#define DBGMCU_CR1_DBG_SLEEP_Pos                   (0U)
#define DBGMCU_CR1_DBG_SLEEP_Msk                   (0x1UL << DBGMCU_CR1_DBG_SLEEP_Pos)                /*!< 0x00000001 */
#define DBGMCU_CR1_DBG_SLEEP                       DBGMCU_CR1_DBG_SLEEP_Msk                           /*!< desc DBG_SLEEP */
#define DBGMCU_CR1_DBG_STOP_Pos                    (1U)
#define DBGMCU_CR1_DBG_STOP_Msk                    (0x1UL << DBGMCU_CR1_DBG_STOP_Pos)                 /*!< 0x00000002 */
#define DBGMCU_CR1_DBG_STOP                        DBGMCU_CR1_DBG_STOP_Msk                            /*!< desc DBG_STOP */
#define DBGMCU_CR1_DBG_STDBY_Pos                   (2U)
#define DBGMCU_CR1_DBG_STDBY_Msk                   (0x1UL << DBGMCU_CR1_DBG_STDBY_Pos)                /*!< 0x00000004 */
#define DBGMCU_CR1_DBG_STDBY                       DBGMCU_CR1_DBG_STDBY_Msk                           /*!< desc DBG_STDBY */
#define DBGMCU_CR1_DBG_IWDG_STOP_Pos               (8U)
#define DBGMCU_CR1_DBG_IWDG_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_IWDG_STOP_Pos)            /*!< 0x00000100 */
#define DBGMCU_CR1_DBG_IWDG_STOP                   DBGMCU_CR1_DBG_IWDG_STOP_Msk                       /*!< desc DBG_IWDG_STOP */
#define DBGMCU_CR1_DBG_WWDG_STOP_Pos               (9U)
#define DBGMCU_CR1_DBG_WWDG_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_WWDG_STOP_Pos)            /*!< 0x00000200 */
#define DBGMCU_CR1_DBG_WWDG_STOP                   DBGMCU_CR1_DBG_WWDG_STOP_Msk                       /*!< desc DBG_WWDG_STOP */
#define DBGMCU_CR1_DBG_TIM1_STOP_Pos               (10U)
#define DBGMCU_CR1_DBG_TIM1_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM1_STOP_Pos)            /*!< 0x00000400 */
#define DBGMCU_CR1_DBG_TIM1_STOP                   DBGMCU_CR1_DBG_TIM1_STOP_Msk                       /*!< desc DBG_TIM1_STOP */
#define DBGMCU_CR1_DBG_TIM2_STOP_Pos               (11U)
#define DBGMCU_CR1_DBG_TIM2_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM2_STOP_Pos)            /*!< 0x00000800 */
#define DBGMCU_CR1_DBG_TIM2_STOP                   DBGMCU_CR1_DBG_TIM2_STOP_Msk                       /*!< desc DBG_TIM2_STOP */
#define DBGMCU_CR1_DBG_TIM3_STOP_Pos               (12U)
#define DBGMCU_CR1_DBG_TIM3_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM3_STOP_Pos)            /*!< 0x00001000 */
#define DBGMCU_CR1_DBG_TIM3_STOP                   DBGMCU_CR1_DBG_TIM3_STOP_Msk                       /*!< desc DBG_TIM3_STOP */
#define DBGMCU_CR1_DBG_TIM4_STOP_Pos               (13U)
#define DBGMCU_CR1_DBG_TIM4_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM4_STOP_Pos)            /*!< 0x00002000 */
#define DBGMCU_CR1_DBG_TIM4_STOP                   DBGMCU_CR1_DBG_TIM4_STOP_Msk                       /*!< desc DBG_TIM4_STOP */
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos      (15U)
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos)   /*!< 0x00008000 */
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT          DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C1_SMBUS_TIMEOUT */
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos      (16U)
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos)   /*!< 0x00010000 */
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT          DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C2_SMBUS_TIMEOUT */
#define DBGMCU_CR1_DBG_TIM6_STOP_Pos               (19U)
#define DBGMCU_CR1_DBG_TIM6_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM6_STOP_Pos)            /*!< 0x00080000 */
#define DBGMCU_CR1_DBG_TIM6_STOP                   DBGMCU_CR1_DBG_TIM6_STOP_Msk                       /*!< desc DBG_TIM6_STOP */
#define DBGMCU_CR1_DBG_TIM7_STOP_Pos               (20U)
#define DBGMCU_CR1_DBG_TIM7_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM7_STOP_Pos)            /*!< 0x00100000 */
#define DBGMCU_CR1_DBG_TIM7_STOP                   DBGMCU_CR1_DBG_TIM7_STOP_Msk                       /*!< desc DBG_TIM7_STOP */

/********************************* Bit definition for DBGMCU_CR2 register *******************************************/
#define DBGMCU_CR2_DBG_TIM15_STOP_Pos              (3U)
#define DBGMCU_CR2_DBG_TIM15_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM15_STOP_Pos)           /*!< 0x00000008 */
#define DBGMCU_CR2_DBG_TIM15_STOP                  DBGMCU_CR2_DBG_TIM15_STOP_Msk                      /*!< desc DBG_TIM15_STOP */

#define DBGMCU_CR2_DBG_TIM16_STOP_Pos              (4U)
#define DBGMCU_CR2_DBG_TIM16_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM16_STOP_Pos)           /*!< 0x00000010 */
#define DBGMCU_CR2_DBG_TIM16_STOP                  DBGMCU_CR2_DBG_TIM16_STOP_Msk                      /*!< desc DBG_TIM16_STOP */

#define DBGMCU_CR2_DBG_TIM17_STOP_Pos              (5U)
#define DBGMCU_CR2_DBG_TIM17_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM17_STOP_Pos)           /*!< 0x00000020 */
#define DBGMCU_CR2_DBG_TIM17_STOP                  DBGMCU_CR2_DBG_TIM17_STOP_Msk                      /*!< desc DBG_TIM17_STOP */

