breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410xB.h
/********************************* Bit definition for DMA_CMAR register ********************************************/
#define DMA_CMAR_MA_Pos                          (0U)
#define DMA_CMAR_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR_MA                              DMA_CMAR_MA_Msk                                  /*!< Memory Address */

/********************************* Bit definition for DMA_CCCFGR register ******************************************/
#define DMA_CNBTR_NBT_Pos                        (0U)
#define DMA_CNBTR_NBT_Msk                        (0xFFUL<<DMA_CNBTR_NBT_Pos)                      /*!< 0x000000FF */
#define DMA_CNBTR_NBT                            DMA_CNBTR_NBT_Msk                                /*!< Number of Block to Loop Transfer */
#define DMA_CNBTR_NDTL_Pos                       (16U)
#define DMA_CNBTR_NDTL_Msk                       (0xFFFFUL<<DMA_CNBTR_NDTL_Pos)                   /*!< 0xFFFF0000 */
#define DMA_CNBTR_NDTL                           DMA_CNBTR_NDTL_Msk                               /*!< Number of Data to Transfer Last Loop */

/********************************************************************************************************************/
/********************************* EXTI *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for EXTI_IMR register *********************************************/
#define EXTI_IMR_IMR0_Pos                          (0U)
#define EXTI_IMR_IMR0_Msk                          (0x1UL<<EXTI_IMR_IMR0_Pos)                       /*!< 0x00000001 */
#define EXTI_IMR_IMR0                              EXTI_IMR_IMR0_Msk                                
#define EXTI_IMR_IMR1_Pos                          (1U)
#define EXTI_IMR_IMR1_Msk                          (0x1UL<<EXTI_IMR_IMR1_Pos)                       /*!< 0x00000002 */
#define EXTI_IMR_IMR1                              EXTI_IMR_IMR1_Msk                                
#define EXTI_IMR_IMR2_Pos                          (2U)
#define EXTI_IMR_IMR2_Msk                          (0x1UL<<EXTI_IMR_IMR2_Pos)                       /*!< 0x00000004 */
#define EXTI_IMR_IMR2                              EXTI_IMR_IMR2_Msk                                
#define EXTI_IMR_IMR3_Pos                          (3U)
#define EXTI_IMR_IMR3_Msk                          (0x1UL<<EXTI_IMR_IMR3_Pos)                       /*!< 0x00000008 */
#define EXTI_IMR_IMR3                              EXTI_IMR_IMR3_Msk                                
#define EXTI_IMR_IMR4_Pos                          (4U)
#define EXTI_IMR_IMR4_Msk                          (0x1UL<<EXTI_IMR_IMR4_Pos)                       /*!< 0x00000010 */
#define EXTI_IMR_IMR4                              EXTI_IMR_IMR4_Msk                                
#define EXTI_IMR_IMR5_Pos                          (5U)
#define EXTI_IMR_IMR5_Msk                          (0x1UL<<EXTI_IMR_IMR5_Pos)                       /*!< 0x00000020 */
#define EXTI_IMR_IMR5                              EXTI_IMR_IMR5_Msk                                
#define EXTI_IMR_IMR6_Pos                          (6U)
#define EXTI_IMR_IMR6_Msk                          (0x1UL<<EXTI_IMR_IMR6_Pos)                       /*!< 0x00000040 */
#define EXTI_IMR_IMR6                              EXTI_IMR_IMR6_Msk                                
#define EXTI_IMR_IMR7_Pos                          (7U)
#define EXTI_IMR_IMR7_Msk                          (0x1UL<<EXTI_IMR_IMR7_Pos)                       /*!< 0x00000080 */
#define EXTI_IMR_IMR7                              EXTI_IMR_IMR7_Msk                                
#define EXTI_IMR_IMR8_Pos                          (8U)
#define EXTI_IMR_IMR8_Msk                          (0x1UL<<EXTI_IMR_IMR8_Pos)                       /*!< 0x00000100 */
#define EXTI_IMR_IMR8                              EXTI_IMR_IMR8_Msk                                
#define EXTI_IMR_IMR9_Pos                          (9U)
#define EXTI_IMR_IMR9_Msk                          (0x1UL<<EXTI_IMR_IMR9_Pos)                       /*!< 0x00000200 */
#define EXTI_IMR_IMR9                              EXTI_IMR_IMR9_Msk                                
#define EXTI_IMR_IMR10_Pos                         (10U)
#define EXTI_IMR_IMR10_Msk                         (0x1UL<<EXTI_IMR_IMR10_Pos)                      /*!< 0x00000400 */
#define EXTI_IMR_IMR10                             EXTI_IMR_IMR10_Msk                               
#define EXTI_IMR_IMR11_Pos                         (11U)
#define EXTI_IMR_IMR11_Msk                         (0x1UL<<EXTI_IMR_IMR11_Pos)                      /*!< 0x00000800 */
#define EXTI_IMR_IMR11                             EXTI_IMR_IMR11_Msk                               
#define EXTI_IMR_IMR12_Pos                         (12U)
#define EXTI_IMR_IMR12_Msk                         (0x1UL<<EXTI_IMR_IMR12_Pos)                      /*!< 0x00001000 */
#define EXTI_IMR_IMR12                             EXTI_IMR_IMR12_Msk                               
#define EXTI_IMR_IMR13_Pos                         (13U)
#define EXTI_IMR_IMR13_Msk                         (0x1UL<<EXTI_IMR_IMR13_Pos)                      /*!< 0x00002000 */
#define EXTI_IMR_IMR13                             EXTI_IMR_IMR13_Msk                               
#define EXTI_IMR_IMR14_Pos                         (14U)
#define EXTI_IMR_IMR14_Msk                         (0x1UL<<EXTI_IMR_IMR14_Pos)                      /*!< 0x00004000 */
#define EXTI_IMR_IMR14                             EXTI_IMR_IMR14_Msk                               
#define EXTI_IMR_IMR15_Pos                         (15U)
#define EXTI_IMR_IMR15_Msk                         (0x1UL<<EXTI_IMR_IMR15_Pos)                      /*!< 0x00008000 */
#define EXTI_IMR_IMR15                             EXTI_IMR_IMR15_Msk                               
#define EXTI_IMR_IMR16_Pos                         (16U)
#define EXTI_IMR_IMR16_Msk                         (0x1UL<<EXTI_IMR_IMR16_Pos)                      /*!< 0x00010000 */
#define EXTI_IMR_IMR16                             EXTI_IMR_IMR16_Msk                               
#define EXTI_IMR_IMR17_Pos                         (17U)
#define EXTI_IMR_IMR17_Msk                         (0x1UL<<EXTI_IMR_IMR17_Pos)                      /*!< 0x00020000 */
#define EXTI_IMR_IMR17                             EXTI_IMR_IMR17_Msk                               
#define EXTI_IMR_IMR18_Pos                         (18U)
#define EXTI_IMR_IMR18_Msk                         (0x1UL<<EXTI_IMR_IMR18_Pos)                      /*!< 0x00040000 */
#define EXTI_IMR_IMR18                             EXTI_IMR_IMR18_Msk                               
#define EXTI_IMR_IMR19_Pos                         (19U)
#define EXTI_IMR_IMR19_Msk                         (0x1UL<<EXTI_IMR_IMR19_Pos)                      /*!< 0x00080000 */
#define EXTI_IMR_IMR19                             EXTI_IMR_IMR19_Msk                               
#define EXTI_IMR_IMR20_Pos                         (20U)
#define EXTI_IMR_IMR20_Msk                         (0x1UL<<EXTI_IMR_IMR20_Pos)                      /*!< 0x00100000 */
#define EXTI_IMR_IMR20                             EXTI_IMR_IMR20_Msk                               
#define EXTI_IMR_IMR21_Pos                         (21U)
#define EXTI_IMR_IMR21_Msk                         (0x1UL<<EXTI_IMR_IMR21_Pos)                      /*!< 0x00200000 */
#define EXTI_IMR_IMR21                             EXTI_IMR_IMR21_Msk                               
#define EXTI_IMR_IMR22_Pos                         (22U)
#define EXTI_IMR_IMR22_Msk                         (0x1UL<<EXTI_IMR_IMR22_Pos)                      /*!< 0x00400000 */
#define EXTI_IMR_IMR22                             EXTI_IMR_IMR22_Msk                               
#define EXTI_IMR_IMR23_Pos                         (23U)
#define EXTI_IMR_IMR23_Msk                         (0x1UL<<EXTI_IMR_IMR23_Pos)                      /*!< 0x00800000 */
#define EXTI_IMR_IMR23                             EXTI_IMR_IMR23_Msk                               

