breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410xB.h
/********************************* Bit definition for RTC_DIVL register *********************************************/
#define RTC_DIVL_RTC_DIV_Pos                      (0U)
#define RTC_DIVL_RTC_DIV_Msk                      (0xFFFFUL<<RTC_DIVL_RTC_DIV_Pos)                  /*!< 0x0000FFFF */
#define RTC_DIVL_RTC_DIV                          RTC_DIVL_RTC_DIV_Msk                              /*!< RTC clock divider low part */

/********************************* Bit definition for RTC_CNTH register *********************************************/
#define RTC_CNTH_RTC_CNT_Pos                      (0U)
#define RTC_CNTH_RTC_CNT_Msk                      (0xFFFFUL<<RTC_CNTH_RTC_CNT_Pos)                  /*!< 0x0000FFFF */
#define RTC_CNTH_RTC_CNT                          RTC_CNTH_RTC_CNT_Msk                              /*!< RTC counter high part */

/********************************* Bit definition for RTC_CNTL register *********************************************/
#define RTC_CNTL_RTC_CNT_Pos                      (0U)
#define RTC_CNTL_RTC_CNT_Msk                      (0xFFFFUL<<RTC_CNTL_RTC_CNT_Pos)                  /*!< 0x0000FFFF */
#define RTC_CNTL_RTC_CNT                          RTC_CNTL_RTC_CNT_Msk                              /*!< RTC counter high part */

/********************************* Bit definition for RTC_ALRH register *********************************************/
#define RTC_ALRH_RTC_ALR_Pos                      (0U)
#define RTC_ALRH_RTC_ALR_Msk                      (0xFFFFUL<<RTC_ALRH_RTC_ALR_Pos)                  /*!< 0x0000FFFF */
#define RTC_ALRH_RTC_ALR                          RTC_ALRH_RTC_ALR_Msk                              /*!< RTC alarm high part */

/********************************* Bit definition for RTC_ALRL register *********************************************/
#define RTC_ALRL_RTC_ALR_Pos                      (0U)
#define RTC_ALRL_RTC_ALR_Msk                      (0xFFFFUL<<RTC_ALRL_RTC_ALR_Pos)                  /*!< 0x0000FFFF */
#define RTC_ALRL_RTC_ALR                          RTC_ALRL_RTC_ALR_Msk                              /*!< RTC alarm low part */

/********************************* Bit definition for RTC_TMPCFGR register ******************************************/
#define RTC_TMPCFGR_TPE_Pos                       (0U)
#define RTC_TMPCFGR_TPE_Msk                       (0x1UL<<RTC_TMPCFGR_TPE_Pos)                      /*!< 0x00000001 */
#define RTC_TMPCFGR_TPE                           RTC_TMPCFGR_TPE_Msk                               /*!< RTC intrusion detection enable */
#define RTC_TMPCFGR_TPAL_Pos                      (1U)
#define RTC_TMPCFGR_TPAL_Msk                      (0x1UL<<RTC_TMPCFGR_TPAL_Pos)                      /*!< 0x00000002 */
#define RTC_TMPCFGR_TPAL                          RTC_TMPCFGR_TPAL_Msk                              /*!< RTC intrusion detection pin level */

/********************************* Bit definition for RTC_TMPCSR register *******************************************/
#define RTC_TMPCSR_CTE_Pos                        (0U)
#define RTC_TMPCSR_CTE_Msk                        (0x1UL<<RTC_TMPCSR_CTE_Pos)                      /*!< 0x00000001 */
#define RTC_TMPCSR_CTE                            RTC_TMPCSR_CTE_Msk                               /*!< RTC clear intrusion detection event */
#define RTC_TMPCSR_CTI_Pos                        (1U)
#define RTC_TMPCSR_CTI_Msk                        (0x1UL<<RTC_TMPCSR_CTI_Pos)                      /*!< 0x00000002 */
#define RTC_TMPCSR_CTI                            RTC_TMPCSR_CTI_Msk                               /*!< RTC clear intrusion detection interrupt */
#define RTC_TMPCSR_TPIE_Pos                       (2U)
#define RTC_TMPCSR_TPIE_Msk                       (0x1UL<<RTC_TMPCSR_TPIE_Pos)                     /*!< 0x00000004 */
#define RTC_TMPCSR_TPIE                           RTC_TMPCSR_TPIE_Msk                              /*!< RTC intrusion detection interrupt enable */
#define RTC_TMPCSR_TEF_Pos                        (8U)
#define RTC_TMPCSR_TEF_Msk                        (0x1UL<<RTC_TMPCSR_TEF_Pos)                      /*!< 0x00000100 */
#define RTC_TMPCSR_TEF                            RTC_TMPCSR_TEF_Msk                               /*!< RTC clear intrusion detection event flag */
#define RTC_TMPCSR_TIF_Pos                        (9U)
#define RTC_TMPCSR_TIF_Msk                        (0x1UL<<RTC_TMPCSR_TIF_Pos)                      /*!< 0x00000200 */
#define RTC_TMPCSR_TIF                            RTC_TMPCSR_TIF_Msk                               /*!< RTC clear intrusion detection interrupt flag */

/********************************* Bit definition for RTC_CALIBR register *******************************************/
#define RTC_CALIBR_CAL_Pos                        (0U)
#define RTC_CALIBR_CAL_Msk                        (0x7FUL<<RTC_CALIBR_CAL_Pos)                      /*!< 0x0000007F */
#define RTC_CALIBR_CAL                            RTC_CALIBR_CAL_Msk                               /*!< RTC Calibration value */
#define RTC_CALIBR_CCO_Pos                        (7U)
#define RTC_CALIBR_CCO_Msk                        (0x1UL<<RTC_CALIBR_CCO_Pos)                      /*!< 0x00000002 */
#define RTC_CALIBR_CCO                            RTC_CALIBR_CCO_Msk                               /*!< RTC Calibration clock output */
#define RTC_CALIBR_ASOE_Pos                       (8U)
#define RTC_CALIBR_ASOE_Msk                       (0x1UL<<RTC_CALIBR_ASOE_Pos)                     /*!< 0x00000004 */
#define RTC_CALIBR_ASOE                           RTC_CALIBR_ASOE_Msk                              /*!< RTC Alarm or second output enable */
#define RTC_CALIBR_ASOS_Pos                       (9U)
#define RTC_CALIBR_ASOS_Msk                       (0x1UL<<RTC_CALIBR_ASOS_Pos)                     /*!< 0x00000004 */
#define RTC_CALIBR_ASOS                           RTC_CALIBR_ASOS_Msk                              /*!< RTC Alarm or second output selection */

/********************************* Bit definition for RTC_BKPDR0 register ******************************************/
#define RTC_BKPDR0_D_Pos                          (0U)
#define RTC_BKPDR0_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR0_D_Pos)                 /*!< 0xFFFFFFFF */
#define RTC_BKPDR0_D                              RTC_BKPDR0_D_Msk                                 /*!< RTC Backup data word0 */

/********************************* Bit definition for RTC_BKPDR1 register ******************************************/
#define RTC_BKPDR1_D_Pos                          (0U)
#define RTC_BKPDR1_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR1_D_Pos)                 /*!< 0xFFFFFFFF */
#define RTC_BKPDR1_D                              RTC_BKPDR1_D_Msk                                 /*!< RTC Backup data word1 */

