breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f410xB.h
/*********************** USART Instances : FIFO mode **************************/
#define IS_USART_FIFO_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** USART Instances : Asynchronous mode *********************/
#define IS_SCI_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** USART Instances : HWFLOW mode ***************************/
#define IS_SCI_HWFLOW_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** USART Instances : Asynchronous mode *********************/
#define IS_SCI_FIFO_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/****************** USART Instances : Driver Enable detection *****************/
#define IS_SCI_DRIVER_ENABLE_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/****************** USART Instances : Auto Baud Rate detection ****************/
#define IS_SCI_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** USART Instances : Asynchronous mode *********************/
#define IS_SCI_HALFDUPLEX_INSTANCE(INSTANCE) ((INSTANCE) == USART1)
                                              
/******************** USART Instances : Asynchronous mode *********************/
#define IS_SCI_LIN_INSTANCE(INSTANCE)        ((INSTANCE) == USART1)

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == UART1) || \
                                    ((INSTANCE) == UART2))

/******************** USART Instances : Half-Duplex mode **********************/
#define IS_USART_HALFDUPLEX_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** USART Instances : LIN mode **********************/
#define IS_USART_LIN_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) ((INSTANCE) == USART1

/********************* UART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/****************** UART Instances : Auto Baud Rate detection *****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/***************** UART Instances : Multi-Processor mode **********************/
#define IS_UART_MULTIPROCESSOR_INSTANCE(INSTANCE)  ((INSTANCE) == USART1)

/***************** UART Instances : DMA mode available **********************/
#define IS_UART_DMA_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

/****************** LPUART Instances : Hardware Flow control ********************/
#define IS_LPUART_HWFLOW_INSTANCE(INSTANCE) ((INSTANCE) == LPUART1)

/****************** LPUART Instances : Hardware Flow control ********************/
#define IS_LPUART_HALFDUPLEX_INSTANCE(INSTANCE) ((INSTANCE) == LPUART1)

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1)

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

/**************************** WWDG Instances *****************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/****************************** PWM Instances *******************************/
#define IS_PWM_INSTANCE(INSTANCE) (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****************** PWM Instances : supporting the break function *************/
#define IS_PWM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) ) 

/************* PWM Instances : at least 1 compare channel *************/
#define IS_PWM_OC1_INSTANCE(INSTANCE)    (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : at least 2 compare channels *************/
#define IS_PWM_OC2_INSTANCE(INSTANCE)   (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : at least 3 compare channels *************/
#define IS_PWM_OC3_INSTANCE(INSTANCE)    (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : at least 4 compare channels *************/
#define IS_PWM_OC4_INSTANCE(INSTANCE)   (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : DMA requests generation (PWMx_DIER.UDE) *********/
#define IS_PWM_DMA_INSTANCE(INSTANCE)     (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : DMA requests generation (PWMx_DIER.OCxDE) *******/
#define IS_PWM_DMA_OC_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/******************** PWM Instances : DMA burst feature ***********************/
#define IS_PWM_DMABURST_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/******************* PWM Instances : output(s) available **********************/
#define IS_PWM_OCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4)) &&                  \
     (((CHANNEL) == PWM_CHANNEL_1) ||          \
      ((CHANNEL) == PWM_CHANNEL_2) ||          \
      ((CHANNEL) == PWM_CHANNEL_3) ||          \
      ((CHANNEL) == PWM_CHANNEL_4)))

/****************** PWM Instances : supporting complementary output(s) ********/
#define IS_PWM_OCXN_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3)) &&                   \
     (((CHANNEL) == PWM_CHANNEL_1) ||           \
      ((CHANNEL) == PWM_CHANNEL_2)))

/****************** PWM Instances : supporting clock division *****************/
#define IS_PWM_CLOCK_DIVISION_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****** PWM Instances : supporting external clock mode *******/
#define IS_PWM_CLOCKSOURCE_ETRMODE_INSTANCE(INSTANCE) (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****************** PWM Instances : supporting counting mode selection ********/
#define IS_PWM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****************** PWM Instances : remapping capability **********************/
#define IS_PWM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 


#define RCC_HSE_MIN          4000000U
#define RCC_HSE_MAX         32000000U

#define RCC_MAX_FREQUENCY  170000000U


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F410xB_H */

